---
kind: property
id: P:Autodesk.Revit.DB.ModelCurveArrArrayIterator.Current
source: html/fad499fb-32ba-18e2-54ad-aeb93512ac4b.htm
---
# Autodesk.Revit.DB.ModelCurveArrArrayIterator.Current Property

Retrieves the item that is the current focus of the iterator.

## Syntax (C#)
```csharp
public virtual Object Current { get; }
```

## Remarks
A new or Reset iterator must have MoveNext called on it before Current will return a valid
 item as per expected behavior of IEnumerator.